# PreviousActiveView Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewActivatedEventArgs..::..PreviousActiveView Property
ViewActivatedEventArgs Class See Also
---
The previously active view.
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2010
# Syntax
C#
---
```text
public View PreviousActiveView { get; }
```

Visual Basic
---
```text
Public ReadOnly Property PreviousActiveView As View
	Get
```

Visual C++
---
```text
public:
property View^ PreviousActiveView {
	View^ get ();
}
```

# Remarks
May be nullNothingnullptra null reference (Nothing in Visual Basic) if there was no previously active view.
# See Also
ViewActivatedEventArgs Class
Autodesk.Revit.UI.Events Namespace